In [28]:
import numpy as np
import pandas as pd

In [29]:
left = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'Name1': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 'subject_id': ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']})
left

   id   Name1 subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [30]:
right = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'Name2': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 'subject_id': ['sub2', 'sub4', 'sub3', 'sub5', 'sub6']})
right

   id  Name2 subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub5
4   5  Betty       sub6

In [31]:
# Merge left and right using outer join on subject_id. Call in df_union

df_union = pd.merge(left, right, on='subject_id', how='outer')
df_union

   id_x   Name1 subject_id  id_y  Name2
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   5.0  Betty
4   5.0  Ayoung       sub5   4.0  Bryce
5   NaN     NaN       sub3   3.0   Bran

In [32]:
# Display the rows of df_union, which contain NaN values. (Itâ€™s considered as the complement of the intersection of two DataFrames) 

df_union[df_union.isnull().any(axis=1)]

   id_x Name1 subject_id  id_y Name2
0   1.0  Alex       sub1   NaN   NaN
5   NaN   NaN       sub3   3.0  Bran